benchmark_results_python_adaptive.txt
Starting Python Adaptive Benchmark
------------------------------------------------
Concurrency: 10
--- /health (c=10) ---
Running 10s test @ http://127.0.0.1:8000/health
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   442.12us  160.37us   6.78ms   91.91%
    Req/Sec     4.56k   185.44     4.95k    66.58%
  183204 requests in 10.10s, 24.29MB read
Requests/sec:  18140.27
Transfer/sec:      2.40MB
--- /health2 (c=10) ---
Running 10s test @ http://127.0.0.1:8000/health2
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   488.64us  689.00us  32.57ms   98.85%
    Req/Sec     4.31k   390.48     4.99k    63.37%
  173090 requests in 10.10s, 22.95MB read
Requests/sec:  17138.14
Transfer/sec:      2.27MB
------------------------------------------------
Concurrency: 50
--- /health (c=50) ---
Running 10s test @ http://127.0.0.1:8000/health
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.55ms    3.20ms  95.18ms   98.17%
    Req/Sec     9.77k     1.23k   26.20k    91.02%
  389750 requests in 10.10s, 51.67MB read
Requests/sec:  38589.42
Transfer/sec:      5.12MB
--- /health2 (c=50) ---
Running 10s test @ http://127.0.0.1:8000/health2
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.26ms    2.02ms  51.80ms   98.51%
    Req/Sec    10.88k     1.31k   23.77k    73.32%
  434309 requests in 10.10s, 57.57MB read
Requests/sec:  43002.36
Transfer/sec:      5.70MB
------------------------------------------------
Concurrency: 100
--- /health (c=100) ---
Running 10s test @ http://127.0.0.1:8000/health
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.69ms    4.76ms  87.36ms   97.42%
    Req/Sec    12.27k     1.13k   15.11k    69.50%
  488204 requests in 10.00s, 64.72MB read
Requests/sec:  48806.44
Transfer/sec:      6.47MB
--- /health2 (c=100) ---
Running 10s test @ http://127.0.0.1:8000/health2
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.77ms    4.07ms  83.21ms   96.24%
    Req/Sec    11.11k     1.05k   13.06k    77.50%
  442193 requests in 10.00s, 58.62MB read
Requests/sec:  44208.34
Transfer/sec:      5.86MB
------------------------------------------------
Concurrency: 200
--- /health (c=200) ---
Running 10s test @ http://127.0.0.1:8000/health
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.37ms    8.45ms 138.66ms   96.13%
    Req/Sec    12.34k     1.36k   16.15k    67.00%
  491494 requests in 10.01s, 65.15MB read
Requests/sec:  49083.27
Transfer/sec:      6.51MB
--- /health2 (c=200) ---
Running 10s test @ http://127.0.0.1:8000/health2
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.82ms    9.45ms 173.16ms   96.46%
    Req/Sec    11.34k     1.03k   15.06k    74.00%
  451553 requests in 10.01s, 59.86MB read
Requests/sec:  45098.62
Transfer/sec:      5.98MB
------------------------------------------------
Concurrency: 300
--- /health (c=300) ---
Running 10s test @ http://127.0.0.1:8000/health
  4 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.40ms   13.30ms 188.59ms   93.83%
    Req/Sec    10.76k     2.01k   14.90k    59.50%
  428711 requests in 10.05s, 56.83MB read
Requests/sec:  42672.20
Transfer/sec:      5.66MB
--- /health2 (c=300) ---
Running 10s test @ http://127.0.0.1:8000/health2
  4 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.53ms   13.26ms 223.08ms   95.60%
    Req/Sec    11.89k     1.31k   14.74k    72.00%
  473456 requests in 10.05s, 62.76MB read
Requests/sec:  47126.43
Transfer/sec:      6.25MB
------------------------------------------------
Concurrency: 500
--- /health (c=500) ---
Running 10s test @ http://127.0.0.1:8000/health
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.82ms   19.62ms 243.38ms   94.25%
    Req/Sec    12.33k     1.13k   16.09k    68.25%
  491323 requests in 10.05s, 65.13MB read
Requests/sec:  48909.28
Transfer/sec:      6.48MB
--- /health2 (c=500) ---
Running 10s test @ http://127.0.0.1:8000/health2
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.44ms   18.68ms 264.91ms   93.58%
    Req/Sec    12.65k     1.13k   15.38k    72.75%
  503965 requests in 10.04s, 66.81MB read
Requests/sec:  50180.48
Transfer/sec:      6.65MB